# указывает, какой образ является базовым для нашего
FROM node:16-alpine

# создание директории приложения
WORKDIR /usr/src/app

# установка зависимостей
# астериск ("*") по возможности скопирует оба файла: package.json и package-lock.json
# тот же символ делает копирование опциональным, т. е. без файла сборка не упадёт
COPY package*.json ./
# Флаг --omit=dev означает - "не ставить devDependencies"
# они не нужны нам в продакшен-окружении
RUN npm i --omit=dev
# копируем исходный код
COPY . .
# сообщаем какой порт использует сервис, который мы докеризируем
EXPOSE 3000
# задаёт команду, которая будет вызвана при запуске контейнера из образа
CMD [ "node", "index.js" ]
